Autodesk.Revit.DB.Structure.ToleranceType
This class represents different tolerance type.
Since:
2026.1
Since:
2026.1

Autodesk.Revit.DB.Structure.ToleranceType.InPlanPanel
Tolerance for Analytical Panel.

Autodesk.Revit.DB.Structure.ToleranceType.Beams
Tolerance for Beams.

Autodesk.Revit.DB.Structure.ToleranceType.Floors
Tolerance for Floors.

Autodesk.Revit.DB.Structure.ToleranceType.ColumnsAndWalls
Tolerance for Columns and Walls.

Autodesk.Revit.DB.Structure.ToleranceType.InPlan
Tolerance for In plan.

Autodesk.Revit.DB.Structure.ToleranceType.Undefined
Undefined Tolerance